test/performance/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"
  environments:
    production:
      target: "https://your-production-url.com"
      phases:
        - duration: 300
          arrivalRate: 10
          rampTo: 100
          name: "Production load test"

scenarios:
  - name: "Health check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: "application/json"

  - name: "User login flow"
    weight: 40
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "user@example.com"
            password: "Test1234!"
          capture:
            - json: "$.token"
              as: "userToken"
          expect:
            - statusCode: 200
            - hasProperty: "token"
      - get:
          url: "/api/profile"
          headers:
            Authorization: "Bearer {{ userToken }}"
          expect:
            - statusCode: 200
            - contentType: "application/json"
            - hasProperty: "user"

  - name: "Registration flow"
    weight: 20
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "{{ $randomString() }}@example.com"
            password: "Test1234!"
            firstName: "Test"
            lastName: "User"
          expect:
            - statusCode: 201

  - name: "Static content"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: "text/html"